Revit 2027 API
ExternalResourceLoadContext.LoadOperationType Property
 An enum value indicating whether the resource load was triggered by an automatic event (such as file open) or an explicit user action.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public LoadOperationType LoadOperationType { get; }
Public ReadOnly Property LoadOperationType As LoadOperationType
	Get
public:
property LoadOperationType LoadOperationType {
	LoadOperationType get ();
}
member LoadOperationType : LoadOperationType with get
Property Value
LoadOperationType
See Also
Reference
ExternalResourceLoadContext Class
Autodesk.Revit.DB Namespace